app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 13]]
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy